# vstGetModeValue

## Description
```pascal
PROCEDURE vstGetModeValue(
				inModeGroup  : LONGINT;
				VAR outValue : LONGINT);
```

```python

def vs.vstGetModeValue(inModeGroup):
    return outValue
```

## Parameters
|Name|Type|Description|
|---|---|---|
|inModeGroup|LONGINT||
|outValue|LONGINT||

## Version
Availability: from Vectorworks 2011
## Category
* Tool Events